<?php
/**
 * Created by PhpStorm.
 * User: Jason
 * Date: 2017/8/28
 * Time: 23:47
 */
return [
    // +----------------------------------------------------------------------
    // | 腾讯云COS设置
    // +----------------------------------------------------------------------

    'bucket' => [
        'open' => false, // 是否开启cos云存储，true为开启，false为关闭，关闭状态默认使用本机存储
        'cdn'  => false,  // 是否开启cdn加速, 开启前请确保腾讯云存储上的cdn可以使用
        'bucketname' => '', // 存储桶名字，云存储开启后必填
        'dst' => '/', // 存储路径, 默认 '/'为根目录
    ],
    'cos' => [
        'app_id' => '', // 云存储开启后必填
        'secret_id' => '', // 云存储开启后必填
        'secret_key' => '', // 云存储开启后必填
        'region' => 'sh', // bucket所属地域：华北 'tj' 华东 'sh' 华南 'gz'
        'timeout' => 60
    ]
    
];